# 9 лабораторная
### 1 вариант

Написать программу, которая находит сумму значений функции _y = 2x<sup>2</sup> + 5x - 3_ в диапазоне от 1 до 10 с шагом 1.

#
C++
```
int main() {
    int sum = 0;
    
    for (int i = 1; i <= 10; i++) {
        sum += 2 * i * i + 5 * i - 3;
    }
    
    cout << sum;
}
```
10М прогонов по 5 раз (среднее): 6 592 мкс
# 
Assembler
```
int main() {
    int sum;
    
    __asm {
      mov edx, 0  // Сумма будет храниться здесь
      mov ecx, 10
    
      m:
          mov eax, ecx
          imul eax, eax  // x^2
          imul eax, 2  // 2x^2
    
          mov ebx, ecx
          imul ebx, 5  // 5x
          add eax, ebx  // 2x^2 + 5x
    
          add eax, -3  // 2x^2 + 5x - 3
    
          add edx, eax
      loop m
      
      mov sum, edx
    }
    
    cout << sum;
}
```
10М прогонов по 5 раз (среднее): 6 509 мкс
#
Вопросы для зачета по работе:
### 1. Какими способами можно организовать циклы на языке ассемблера?

for и loop

### 2. Как в общем случае организуется цикл for?

Задаём регистру счётчика _cx_ количество итераций. Возвращаемся к метке _for_, пока счётчик _cx_ не станет равным 0.

### 3. Как организовать цикл for на языке ассемблера?
```
mov cx, n
for:
   ; тело цикла
   dec cx
   cmp x, 0
   jne for
```
